---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentOpening
source: html/5565fc31-45e8-2fff-9682-64f8473a20d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentOpening Property

While making curved beam type "[Type Name]" Opening elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentOpening { get; }
```